{"data":{"markdownRemark":{"html":"<p>Earlier this week I gave a presentation to my peers at work on utilizing <a href=\"https://quarkus.io/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Quarkus</a> to create native Java applications, throw them into a container, and then utilize them in a simple (if such a thing is possible) <a href=\"https://kubernetes.io/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Kubernetes</a> stack with <a href=\"https://kubernetes.io/docs/setup/minikube/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">minikube</a>. In this talk, I also touched upon the architecture topics of microservices, serverless, and container-based applications. I found it to be a good talk in that it sparked interest and raised questions. Also, the live demo went fairly smoothly. However, there were parts that I would like to change up. So, without further ado, here are some of my thoughts on my talk.</p>\n<ul>\n<li>\n<p>First of all, it is important to know that my current place of employment is still supporting a monolithic application. This is fairly important context when thinking about the architecture topics that I brought up in this talk. In our case, it is a major leap from monolith to serverless.</p>\n<p>With this in mind, a thirty-minute talk (it blew up into closer to an hour) was not even close to sufficient to bring up the question of how to evolve our architecture. Nor was it sufficient to discuss the more practical topic of stepping stones to getting there - of which I posed Quarkus as a potentially useful tool in doing so. Right after the talk was over, I realized that my talk kind of split in two different directions - architecture (specifically, monolith to microservices to serverless) and Quarkus. For future talks on the subjects, I need to separate those concerns.</p>\n</li>\n<li>\n<p>After the talk was finished, the audience brought up topics such as tools, languages, and the means of arriving at a better architecture. These were very interesting topics that arose which spurred along a conversation for nearly 15 minutes. It seemed some were almost fixed on deciding that to get to the paradise land of the future (a sarcastic name that some colleagues throw towards anything other than a monolith) we needed to decide on the tools and, more specifically, language(s) to create our services in. I think that some even took (and still take) a defensive route, claiming that \"this tool/language is the answer\", and I don't think that attitude will change. </p>\n<p>I really enjoyed the conversation. However, the thoughts that followed were better. Many people appeared to look at our system and try to fit it into a solution. Obviously, this rarely ever works. It doesn't make sense to analyze the tools we need before we even understand what our services and needs are. During the talk, I used the metaphor of chiseling away at our monolith until we find things that easily split off. From there, we have things that easily become microservices and, potentially, smaller functions. As we arrive at each new piece that needs to be addressed, we <strong>choose and use the <em>tools of choice</em> that <em>help us solve the problem at hand</em></strong>. After all, one of the beauties of serverless and splitting our concerns is that we can focus on the task at hand and not worry about the other tasks. </p>\n</li>\n<li>\n<p>Lastly, I really liked the metaphor of chiseling away at the application that we are evolving. Not only does it make sense from the standpoint of \"I have 5 million lines of code and can't rework that easily\", but it also really helps the health of the app as we go in many ways. Each piece we break out generally becomes smaller, simpler, and more focused. Now we can look at a small piece of software and say it takes <em>x</em>, outputs <em>y</em>, and does <em>z</em>. It's apparent and immediately known if we need it and (sometimes more importantly) if we do not. It also forces us to do a few things:</p>\n<ul>\n<li>address the issue at hand and only that issue</li>\n<li>rework or completely rewrite suspect pieces of software</li>\n<li>bring testing up to date</li>\n<li>narrow the scope of pieces of software</li>\n</ul>\n</li>\n</ul>\n<p>All in all, the talk was well-received based on the conversations and topics that came from it. I plan to give the talk in the future to local user groups. When I do this, I plan to include the slides and a tutorial. The plan is to narrow the scope of the talk and delve deeper into Quarkus. I think that this will allow people to see the possibilities and to continue from there.</p>","fields":{"slug":"java-in-the-clouds-talk"},"frontmatter":{"title":"Java in the Clouds Talk","date":"30.03.2019","category":"Coding","tags":["Coding"],"banner":"/assets/bg/3.jpg"},"timeToRead":3}},"pageContext":{"slug":"java-in-the-clouds-talk","prev":{"excerpt":"I attended DevNexus 2019! This Java conference has been held yearly in Atlanta for quite a few years now.  It was great to explore a new city (albeit lightly), hang out amongst a lot of other software developers, and learn a lot for a few days. The…","html":"<p>I attended DevNexus 2019! This Java conference has been held yearly in Atlanta for quite a few years now.  It was great to explore a new city (albeit lightly), hang out amongst a lot of other software developers, and learn a lot for a few days. The conference this year seemed to have a few major themes: cloud-forward everything, evolving architecture, and continuing to move towards functional programming. In this post, I roundup and recap a lot of my trip.</p>\n<p>Keep in mind that I will be going much further in depth into a lot of these topics in the near future with talks, blog posts, and tutorials. If you do not get all the detail or information you want from these brief explanations, stick around. Further, feel free to reach out to me on <a href=\"https://twitter.com/devissquared\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Twitter</a> if you would like more info or are particularly interested in a certain topic.</p>\n<p>Also I try to give links to any relevant information that I can within the content. Some of it are links to videos of the presentations at other conferences. The recordings for DevNexus has not yet been made available.</p>\n<h2 id=\"goals-prior-to-attending\"><a href=\"#goals-prior-to-attending\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Goals Prior to Attending</h2>\n<p>I do want to take a second and outline some of the goals that I had going into the conference. The last one is a goal of mine all of the time.</p>\n<ul>\n<li>Learn about moving legacy code to newer architectures</li>\n<li>Learn all the new hotness with serverless, cloud-native functions, and similar <strong>buzzwords</strong></li>\n<li>Learn about Groovy to help some of our testing efforts at work</li>\n<li>Eat good food (an obvious goal for visiting any place, especially a new one)</li>\n</ul>\n<h2 id=\"general-thoughts\"><a href=\"#general-thoughts\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>General Thoughts</h2>\n<p>From the moment that the conference started, I was having a great time. The venue was fairly nice, which was fine considering it was moved here as a backup due to the Super Bowl being held in Atlanta only a month or so before. Only complaint here is that the vendor booths were crammed into a smaller hallway than seemed necessary with a wide hall close by. The keynote stage was really well done with 6 screens so that nobody missed a thing. And I had coffee provided every morning and afternoon, which is always a great thing.</p>\n<h3 id=\"keynotes\"><a href=\"#keynotes\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Keynotes</h3>\n<p>The keynotes were all great. Three in total:</p>\n<ul>\n<li>The first one given by <a href=\"https://twitter.com/venkat_s\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Venkat Subramaniam</a> had a great comparison in it - Imperative is to Functional as wave is to particle when talking about light. Meaning that rather than argue which is better (imperative or functional) when talking about approaches to programming, why not think of it as a duality like the <a href=\"https://en.wikipedia.org/wiki/Wave%E2%80%93particle_duality\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">wave-particle duality</a> of light? I think that this was nice to hear after recently hearing coworkers argue back and forth on the two approaches' behalf. Both have issues when left by themselves (not the coworkers, the schools of thought), but the amount of either that is deemed best has long been the question. Do I write X in this approach even though it feels long, sloppy, and hard to read? Or, do I write Y in this other approach though it feels disconnected, complex, and difficult to write? The answer seems to be in the middle. </li>\n<li>The next given by the CTO of ThoughtWorks, <a href=\"https://www.thoughtworks.com/profiles/rebecca-parsons\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Rebecca Parsons</a>, was also very interesting and well-done. Let me tell you that one of my favorite parts of this talk was the design of the slide deck. Crisp, all-white slides with single lines of black text along with all-black title slides that had a single, thick-weighted white title; images took up a separate slide without any other content. It was so good that that night I created a custom slide theme after it. The talk itself was about evolutionary architecture and getting your application there. She talked about applying a fitness function to your architecture with which to constantly measure your applications health and gain insights into what needs to be done. This fitness function created with multiple \"-ilities\" (maintainability, testability, scalability, etc), but - crucially - not all of the \"-ilities\". Also priorities on what needs to be fixed and done first. I enjoyed hearing this talk as I have never applied this kind of thinking to architecture.</li>\n<li>The third was one of my favorites from the entire weekend. <a href=\"https://www.youtube.com/watch?v=0h5X5UKWao8&#x26;t=2559s\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Leadership Guide for the Reluctant Leader</a> was a great talk about being a better coworker and becoming a leader. Though this talk had nothing technical in it, it was great to hear <a href=\"https://twitter.com/reverentgeek\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">David Neal</a> give his experience of climbing up to leadership roles and some of the pains and awkwardness that came about. I highly recommend both following him on Twitter and checking at his talk on Youtube. Not only was he a great presenter but he also draws all of his slides. Was a great kickoff to the second day of presentations with plenty of good laughs.</li>\n</ul>\n<h3 id=\"day-one-highlights\"><a href=\"#day-one-highlights\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Day One Highlights</h3>\n<p>I was really interested to attend presentations as this was my first time to be in person at a conference rather than just behind a video of it. My favorite presentations were as follows:</p>\n<ul>\n<li>A developer and dev advocate from IBM, <a href=\"https://twitter.com/gcharters\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">gcharters</a> and <a href=\"https://twitter.com/spoole167\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Steve Poole</a> respectively, gave a talk on cloud native Java and a bit about serverless technology. This talk was the first that I had learned about <a href=\"https://openliberty.io/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Open Liberty</a> and first I had seen <a href=\"https://www.ibm.com/cloud/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">IBM Cloud</a> in use. The talk was very informative and came with a tutorial (which is huge brownie points from me). If you stopped by the IBM booth at the conference, you could mess around with all of the things talked about in the talk and earn a free shirt (best believe I did that!). The other thing that I really appreciated from this talk was that these were potential solutions that one could explore, though serverless is not the answer for every problem. This was a little refreshing after hearing (what seemed like) a thousand conversations of how attendees were going to move from a <a href=\"https://en.wikipedia.org/wiki/Monolithic_application\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Monolith</a> to <a href=\"https://www.serverlessops.io/what-is-serverless\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Serverless</a> when they got back to work.</li>\n<li>A <a href=\"https://github.com/mikestowe/REST-API-Multiple-Request-Chaining\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">technique</a> for chaining REST calls together was unveiled in another talk. The talk went over some of the issues that a lot of API architectures have had as we have progressed - think SOAP, REST, GraphQL. <a href=\"https://twitter.com/mikegstowe\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Mike</a> did a great job of talking about some of each API's strengths/weaknesses and use cases. </li>\n<li>My favorite talk of day one had to have been <a href=\"https://www.youtube.com/watch?v=I9SqEvUOAoM&#x26;t=448s\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Badass 101</a>. This talk had the best abstract (simply a paragraph explaining something to the effect of Chuck Norris not providing an abstract but we should attend to avoid potentially catching a roundhouse kick to the face) and then great content. This talk covered a lot of areas of the concept of \"soft skills\", though I prefer we call them people skills (or human skills, as that's what they are). I recommend that you watch this talk and be a badass!</li>\n</ul>\n<p>I also went to a local restaurant called Murph's for lunch. And let me tell you that it has a great buffalo chicken sandwich and fries. I love sports bars (probably because I am one with sports and beer is literally my blood), so this place hit the spot. Later in the day, I went to another sports bar in Atlanta to try and catch the Atlanta Hawks game and fellow Sooner Trae Young. However, the bar did not put the game on any of the TVs, I was very sad, and, therefore, I do not want to name this bar.</p>\n<h3 id=\"day-two-highlights\"><a href=\"#day-two-highlights\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Day Two Highlights</h3>\n<p>Day two was the day that I was expecting everybody to be tired and sluggish. However, I was delightfully surprised starting with the keynote in the morning. The talks throughout day two seemed to go up and down - one would be good and the next would be pretty eh. Most seemed ready to get to the big giveaway at the end of the day. That day gave me two good talks:</p>\n<ul>\n<li>One of the more applicable talks to my work was a talk on Architectures and moving from Monolith to Microservices and maybe onto Serverless. I particularly liked the way that this was organized. <a href=\"https://twitter.com/betoSalazar\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Alberto Salazar</a> walked through the process of moving (sometimes painfully slowly) from a Monolith to Microservices. He also provided a great <a href=\"https://github.com/lasalazarr/guide-monolithic-to-microservices\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">guide</a> to work through. </li>\n<li>The talk that I got the most out of was <a href=\"https://twitter.com/burrsutter\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Burr Sutter's</a> talk on cloud native Java with <a href=\"https://cloud.google.com/knative/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Knative</a>. First of all, the slide deck, pages of documentation, and plenty of tutorials were given to those in attendance (obvious or not, every presenter needs to make a habit of doing this). This meant that during the presentation, I could sit back and enjoy the show. Burr moved quickly and filled our time with loads of information. This was what I worked on after the second day. Look out for a blog post and a talk coming soon on this topic.</li>\n</ul>\n<p>Murph's was so good that I returned there for day two's lunch and had a burger and more local beer - both very good. For my later meal, I tried out Blaze Pizza and was super impressed. Lebron knows where to invest his money.</p>\n<h2 id=\"conclusion\"><a href=\"#conclusion\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Conclusion</h2>\n<p>I had a lot of fun at my first dev conference - DevNexus 2019 in Atlanta. I learned a lot and now have plenty of new toys to tinker with. My loot haul included 3 t-shirts, 3 pairs of socks, an infinite amount of stickers, and a bottle of hand sanitizer. The food was all very good. The only complaint was that an Atlanta sports bar did not show an Atlanta sports team playing in Atlanta. </p>\n<p>Posts to come as follow up for a more in-depth dive into some of the content that I absorbed. </p>","id":"44dcf995-5911-5f51-8feb-3588b3a11c04","fields":{"slug":"my-first-dev-conference-2019-dev-nexus"},"frontmatter":{"date":"2019-03-24T22:16:03.284Z","title":"My First Dev Conference - 2019 DevNexus","category":"Coding","tags":["Coding"],"banner":"/assets/bg/1.jpg"},"timeToRead":7},"next":{"excerpt":"So Paul George very well may have had a major impact on this years NBA playoffs, at least the western side of the bracket. This impact came from a single shot - a  buzzer beater to beat the Rockets  on Tuesday. Let's ignore the fact that there was a…","html":"<p>So Paul George very well may have had a major impact on this years NBA playoffs, at least the western side of the bracket. This impact came from a single shot - a <a href=\"https://www.youtube.com/watch?v=Ethe4x7Mnfo\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">buzzer beater to beat the Rockets</a> on Tuesday. Let's ignore the fact that there was a plethora of other things that had to be right in this moment, because nobody cares about the fact that the Death Star had a single meter-wide point of failure. They only care about the amazing moment when Luke glided through a trench, disabled the automated aiming system, and then <a href=\"https://www.youtube.com/watch?v=KuKqcfO31is&#x26;t=3s\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">blew the Empire's toy to pieces</a>.  So, let's just look at that sweet moment that the ball swished through that beautiful twine net. And what it could and has caused.</p>\n<p>For a little more context, let's explain where everything ended up right after that shot went through. That shot put the Thunder at 48-33 heading into the final game. They sat at 6th in the West at that point with on game to play. It put the Rockets finishing the regular season at 53-29. They sat at 3rd in the West then. If the season would have ended right then and there, the Western conference playoffs would have looked like this:</p>\n<p>- Golden State Warriors vs Los Angeles Clippers</p>\n<p>- Denver Nuggets vs San Antonio Spurs</p>\n<p>- Houston Rockets vs Oklahoma City Thunder</p>\n<p>- Portland Trail Blazers vs Utah Jazz</p>\n<p>Let's look at how each team did in their final regular season game and how the playoff picture ended up as it did.</p>\n<h2 id=\"clippers-sail-in\"><a href=\"#clippers-sail-in\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Clippers Sail in</h2>\n<p>The Clippers final day was filled with potential. With a win and a few losses from the teams around them, the Clips could have moved all the way up to 6th. They were to play the Jazz who were already locked into the 5th slot. Utah put up a fight though. The game ended in overtime with the Clippers pulling away. However, the waters didn't clear up as the teams around them ended up winning. This locked the Clippers into the 8th spot with, almost certainly, impending doom looming in the mighty Warriors.</p>\n<p>Since the Warriors game did not matter, we have our first matchup of the playoffs for the West:</p>\n<p>- Golden State Warriors vs Los Angeles Clippers</p>\n<h2 id=\"spurs-still-kickin\"><a href=\"#spurs-still-kickin\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Spurs Still Kickin'</h2>\n<p>Spurs also had a fair amount of potential with moving up with a win and a Thunder loss. They also got to sit and wait to see who the first round opponent they would end up facing (more on that in a second). Spurs faced the Mavs and were tasked with spoiling Dirk's final NBA game. They did as such fairly easily and waited for the rest of the fray to unfold to know where they landed.</p>\n<h2 id=\"nuggets-find-gold\"><a href=\"#nuggets-find-gold\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Nuggets Find Gold</h2>\n<p>After a year that saw Denver missing the playoffs, the Nuggets claw their way all the way up towards the top. The young squad, built around a skilled big man in Jokic, surprised a lot of people with the way they kept finding ways to win. Their final day had a little potential - ultimately, win and stay in the 2 slot. If they were to lose, there were a few scenarios with the most likely being slotted to 3. Winning they did though; dispatching the Timberwolves. This slotted them firmly into the 2 seed which makes the turnaround even better for them this year.</p>\n<h2 id=\"thunder-glide-in\"><a href=\"#thunder-glide-in\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Thunder Glide In</h2>\n<p>Going into the game versus the Rockets on Tuesday, it seemed like the Thunder were destined to be an 8th seed. It felt like a free fall that would end with an inevitable spanking from the Golden Boys from the Bay. Then, Paul George hit a shot that sent me into a state of incredible excitement and this plummet turned into a nice rise. I like to picture that Paul George is Tom Cruise in Top Gun pulling a fighter jet out of a dive with perfection.</p>\n<p>The Thunder still had plenty of possibilities for the final night. The seeds that they could end up in were 6-8. The good thing was that Giannis \"the Perfect Human for Basketball\" Antetokounmpo was to sit out the game. Though this was offset when it was announced that Paul George would also be missing the affair. However, the Thunder pulled it off. And this slotted them into the 6th spot, which is still mind boggling since the Thunder always struggle if it is past the All-Star Break.</p>\n<p>All seemed set until...</p>\n<h2 id=\"blazers-from-the-top-rope\"><a href=\"#blazers-from-the-top-rope\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Blazers from the Top Rope</h2>\n<p>Going into the last day, Portland seemed to be content with a 4th seed finish and a matchup with the Jazz. They played the Kings (a great season for the Kings by the way) who were already eliminated from anything meaningful by this point. The second half of this game started with the Kings up by 25 points. The Blazers also were playing only 6 players like it was an intramural game or something. At that moment, the Thunder were locked into playing the Rockets and scheming on who should try and stop Harden in the first round. But then, Anfernee Simons (a rookie no less) decided to carry the 6-man squad from Portland all the way back from the huge deficit. NBA Twitter went crazy and Portland changed the layout of the Playoffs. Portland stomped the Rockets down a slot and took the 3 seed from Houston's idle hands. This was drastic, but more on that in a second.</p>\n<h2 id=\"final-western-conference-standings\"><a href=\"#final-western-conference-standings\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Final Western Conference Standings</h2>\n<p>So after all of this craziness, here is what the playoff picture looks like for the Western Conference:</p>\n<p>- Golden State Warriors vs Los Angeles Clippers</p>\n<p>- Denver Nuggets vs San Antonio Spurs</p>\n<p>- Portland Trail Blazers vs Oklahoma City Thunder</p>\n<p>- Houston Rockets vs Utah Jazz</p>\n<p>Now let’s talk about why this scenario is pretty crazy. Prior to this season, the going thought was that the only true threat to the Warriors run at the Western Conference Title was Houston (with a few others having much lower chances). This matchup, then, should be the actual Western Conference Finals matchup in theory. That is now impossible as assuming wins for Houston and Golden State in the first round, they match up in the second round. This opens up a pathway for every other team on the opposite side - Denver, OKC, Trail Blazers, and Spurs. Further, if the Rockets or Warriors have to   expend a lot of energy to defeat this thought-to-be biggest obstacle, the western conference could have a surprising victor.</p>\n<p>There are a few other smaller interesting pieces that this opens up as well. For instance, we now have the Nuggets, a team with very little playoff experience, slotted to play the Spurs, a team that is known for being a force in the playoffs every single year. We have the Thunder playing the Blazers. The Thunder are the lower seed but also won all 4 games against the Blazers during the regular season. But with a series of games in the playoffs, some of these smaller story lines mean a little less.</p>\n<h2 id=\"paul-george-and-the-shot\"><a href=\"#paul-george-and-the-shot\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Paul George and the Shot</h2>\n<p>Let's head back to that fateful shot and recap what this set into motion.</p>\n<p>OKC vs Houston on April 9th was the Rockets final game. A win and the Rockets are guaranteed to be the 2 seed. This also hands the Thunder a loss and an all-but-certain slot as the 8 seed. Paul George winning at the buzzer potentially gives a lot of reclaimed hope to the Thunder. With a loss, the Thunder are a likely first round exit (again). With this shot and win, they can now be comfortable that the biggest foe (and rival) Golden State is far away. And look at a much more open side of the bracket with a chance to play for a Western Conference Finals title.</p>\n<p>I like to think of Paul George pushing a teetering boulder to start its roll down a mountain. Then, the next night the Blazers full-on Chuck-Norris-in-his-prime drop-kicked that sucker into a rolling boulder of Western Conference mayhem. And it seems the Rockets may be the heel that the boulder is nipping at.</p>\n<p>The NBA Playoffs look to be an exciting time this year!</p>","id":"e5a3ed44-39ca-57d4-8445-09b3343aa8e2","fields":{"slug":"paul-george-may-have-changed-the-2019-nba-playoffs-with-one-shot"},"frontmatter":{"date":"2019-04-11T22:16:03.284Z","title":"Paul George May Have Changed the 2019 NBA Playoffs with One Shot","category":"Sports","tags":["Sports"],"banner":"/assets/bg/2.jpg"},"timeToRead":6}}}